{
    "JS":[
        "How would you check if an array contains a specific value?",
        "How do you detect the type of a variable in JavaScript?",
        "What is the difference between 'slice' and 'splice' methods in JavaScript?",
        "How would you concatenate two arrays in JavaScript?",
        "Explain the concept of 'map' in JavaScript. How would you use it with arrays of strings?",
        "How would you remove duplicates from an array of strings?",
        "Explain the difference between 'forEach' and 'map' methods in JavaScript.",
        "How would you sort an array of strings in alphabetical order?",
        "What is the purpose of the 'filter' method in JavaScript? Provide an example of its usage.",
        "How would you reverse the order of elements in an array of strings?",
        "How do you clone an object in JavaScript?",
        "Explain the concept of closures in JavaScript.",
        "What is the difference between 'null' and 'undefined' in JavaScript?",
        "Explain the difference between '=='' and '===' in JavaScript.",
        "How would you remove an element from an array in JavaScript?",
        "What is the purpose of the 'reduce' method in JavaScript? Provide an example of its usage.",
        "Explain the concept of hoisting in JavaScript.",
        "What are the different ways to copy an object in JavaScript?",
        "How would you find the maximum and minimum values in an array of numbers?",
        "What is the purpose of the 'bind' method in JavaScript? Provide an example of its usage.",
        "Explain the concept of event bubbling and event capturing in JavaScript.",
        "How would you convert an object to a JSON string in JavaScript?",
        "What is the purpose of the 'some' method in JavaScript? Provide an example of its usage.",
        "Explain the concept of prototypal inheritance in JavaScript.",
        "What are arrow functions in JavaScript? How are they different from regular functions?",
        "How would you check if a variable is an array in JavaScript?",
        "What is the purpose of the 'split' method in JavaScript? Provide an example of its usage.",
        "Explain the concept of object destructuring in JavaScript.",
        "How would you find the length of an object in JavaScript?",
        "What is the purpose of the 'setTimeout' function in JavaScript? Provide an example of its usage.",
        "Explain the concept of lexical scoping in JavaScript.",
        "What are the different types of error handling mechanisms in JavaScript?",
        "How would you convert a JSON string to an object in JavaScript?",
        "What is the purpose of the 'push' and 'pop' methods in JavaScript? Provide an example of their usage.",
        "Explain the concept of event delegation in JavaScript.",
        "How would you merge two objects in JavaScript?",
        "What is the purpose of the 'indexOf' method in JavaScript? Provide an example of its usage.",
        "Explain the concept of strict mode in JavaScript.",
        "How would you convert a number to a string in JavaScript?",
        "What are the different ways to loop through an array in JavaScript?",
        "What is the purpose of the 'find' method in JavaScript? Provide an example of its usage.",
        "Explain the concept of function currying in JavaScript.",
        "How would you remove whitespace from the beginning and end of a string in JavaScript?",
        "What is the purpose of the 'isNaN' function in JavaScript? Provide an example of its usage.",
        "Explain the concept of the 'this' keyword in JavaScript",
        "How would you clone an array in JavaScript?",
        "What is the purpose of the 'forEach' method in JavaScript? Provide an example of its usage.",
        "Explain the concept of function scope and block scope in JavaScript.",
        "How would you convert a string to lowercase or uppercase in JavaScript?",
        "What is the purpose of the 'findIndex' method in JavaScript? Provide an example of its usage.",
        "Explain the concept of the event loop in JavaScript.",
        "How would you check if an object has a specific property in JavaScript?",
        "What is the purpose of the 'sort' method in JavaScript? Provide an example of its usage.",
        "Explain the concept of immutability in JavaScript.",
        "How would you truncate a string in JavaScript?",
        "How would you find the index of the first occurrence of an element in an array in JavaScript?",
        "What is the purpose of the 'every' method in JavaScript? Provide an example of its usage.",
        "Explain the concept of function declarations vs function expressions in JavaScript.",
        "How would you remove a specific character from a string in JavaScript?",
        "What is a closure in JavaScript?",
        "Explain the concept of currying in JavaScript.",
        "What are the differences between function declaration and function expression?",
        "What is the purpose of the 'this' keyword in JavaScript?",
        "Explain the event delegation pattern in JavaScript.",
        "What are the different ways to create objects in JavaScript?",
        "What is a generator function in JavaScript?",
        "What are the differences between 'null' and 'undefined' in JavaScript?",
        "Explain the 'prototype' property in JavaScript.",
        "What is the difference between '=='' and '===' operators in JavaScript?",
        "Explain the concept of hoisting in JavaScript.",
        "What are the differences between 'var', 'let', and 'const' in JavaScript?",
        "What is the difference between 'map' and 'forEach' methods in JavaScript?",
        "Explain the concept of IIFE (Immediately Invoked Function Expression) in JavaScript.",
        "What are the different ways to handle asynchronous operations in JavaScript?",
        "What is the purpose of the 'bind' method in JavaScript?",
        "Explain the concept of memoization in JavaScript.",
        "What is the difference between 'call', 'apply', and 'bind' methods in JavaScript?",
        "Explain the event loop in JavaScript.",
        "What is a pure function in JavaScript?",
        "What is the purpose of the 'Promise' object in JavaScript?",
        "Explain the concept of immutability in JavaScript.",
        "What are the differences between 'debouncing' and 'throttling' in JavaScript?",
        "What is the purpose of the 'async/await' keywords in JavaScript?",
        "What is the difference between 'shallow copy' and 'deep copy' in JavaScript?",
        "Explain the concept of event bubbling and event capturing in JavaScript.",
        "Explain the concept of memoization and its benefits in JavaScript.",
        "What are the differences between '==', '===', and 'Object.is' in JavaScript?",
        "What are the differences between 'var', 'let', and 'const' when used in loops?",
        "Explain the concept of 'strict mode' in JavaScript.",
        "What are the differences between 'Object.freeze()' and 'const' in JavaScript?",
        "What are the differences between 'static' and 'instance' methods in JavaScript classes?",
        "What is the purpose of the 'Set' data structure in JavaScript?",
        "Explain the concept of 'memoization' and its benefits in JavaScript.",
        "What are the differences between 'map' and 'filter' methods in JavaScript?",
        "What is the purpose of the 'Symbol.iterator' in JavaScript?",
        "Explain the concept of 'arrow functions' in JavaScript and how they differ from regular functions.",
        "What are the differences between 'async/await' and 'Promises' in JavaScript?",
        "What is the purpose of the 'WeakMap' and 'WeakSet' objects in JavaScript?",
        "Explain the concept of 'closures' in JavaScript and provide an example of its usage.",
        "What are the differences between 'Object.keys()', 'Object.values()', and 'Object.entries()' methods in JavaScript?",
        "What is the purpose of the 'spread' operator (...) in JavaScript?",
        "Explain the concept of 'prototype inheritance' in JavaScript and how it works.",
        "What are the differences between 'let' and 'const' in JavaScript when used in block scope?",
        "What is the purpose of the 'event.preventDefault()' method in JavaScript?",
        "Explain the concept of 'pure functions' in JavaScript and their advantages.",
        "What are the differences between 'call()', 'apply()', and 'bind()' methods in JavaScript when used to invoke functions?",
        "What is the purpose of the 'Map' data structure in JavaScript?",
        "Explain the concept of 'async generators' in JavaScript.",
        "What are the differences between 'let' and 'var' in JavaScript?",
        "What is the purpose of the 'fetch' API in JavaScript and how does it work?",
        "Explain the concept of 'promise chaining' in JavaScript.",
        "What are the differences between 'forEach()', 'map()', and 'reduce()' methods in JavaScript?",
        "What is the purpose of the 'event.stopPropagation()' method in JavaScript?",
        "Explain the concept of 'hoisting' in JavaScript and how it affects variable declarations.",
        "What are the differences between 'instanceof' and 'typeof' operators in JavaScript?",
        "What is the purpose of the 'Object.defineProperty()' method in JavaScript?",
        "Explain the concept of 'memoization' and how it can be implemented in JavaScript.",
        "What are the differences between 'function declaration' and 'function expression' in JavaScript?",
        "What is the purpose of the 'call stack' in JavaScript?",
        "Explain the concept of 'prototypal inheritance' in JavaScript and provide an example.",
        "What are the differences between 'async/await' and 'callbacks' in JavaScript?",
        "What is the purpose of the 'Object.seal()' method in JavaScript?",
        "Explain the concept of 'currying' in JavaScript and provide an example."
        
    ],
    "React":[
        "What is React.js and what are its key features?",
        "Explain the difference between functional components and class components in React.",
        "What is JSX in React and how does it differ from HTML?",
        "What are React hooks and how do they differ from class components?",
        "What is the virtual DOM in React and how does it improve performance?",
        "What are the lifecycle methods in React class components?",
        "Explain the concept of state in React and how it is different from props.",
        "What is the purpose of the 'key' prop in React and when should it be used?",
        "What is React Router and how can it be used for routing in React applications?",
        "What is the significance of 'setState' in React and how does it work?",
        "Explain the concept of controlled and uncontrolled components in React.",
        "What are React fragments and why are they useful?",
        "How can you pass data from parent components to child components in React?",
        "What is the purpose of the 'componentDidMount' lifecycle method in React?",
        "Explain the concept of conditional rendering in React.",
        "What is the purpose of the 'useEffect' hook in React?",
        "What are React refs and how can they be used?",
        "What is prop drilling in React and how can it be avoided?",
        "Explain the concept of higher-order components (HOCs) in React.",
        "What is the purpose of the 'shouldComponentUpdate' lifecycle method in React?",
        "What are React portals and how can they be used?",
        "Explain the concept of error boundaries in React.",
        "What is Redux and how does it relate to React?",
        "What are React context and useContext? How can they be used for state management?",
        "What is the purpose of the 'memo' function in React and when should it be used?",
        "Explain the concept of lazy loading in React.",
        "What are React hooks rules and best practices?",
        "What is the difference between 'React.createElement' and JSX?",
        "Explain the concept of server-side rendering (SSR) in React.",
        "What is the purpose of the 'useReducer' hook in React?",
        "What are React controlled components and why are they important?",
        "Explain the concept of code splitting in React.",
        "What is the significance of the 'key' prop in a list of elements?",
        "What are the differences between React and Angular?",
        "Explain the concept of pure components in React.",
        "What is the purpose of the 'useContext' hook in React?",
        "What are React hooks rules and best practices?",
        "Explain the concept of portals in React.",
        "What is the purpose of the 'useCallback' hook in React?",
        "What are React functional components and when should you use them?",
        "Explain the concept of CSS-in-JS in React.",
        "What is the purpose of the 'useMemo' hook in React?",
        "What are React error boundaries and how can they be used?",
        "Explain the concept of controlled vs uncontrolled form components in React.",
        "What is the purpose of the 'useLayoutEffect' hook in React?",
        "What are React higher-order components (HOCs) and how can they be used?",
        "Explain the concept of React suspense.",
        "What is the purpose of the 'useRef' hook in React?",
        "What are React hooks rules and best practices?",
        "Explain the concept of CSS modules in React.",
        "Explain the concept of render props in React and how they can be used.",
        "What is the purpose of React context API and how does it work?",
        "What are React hooks custom implementation guidelines and best practices?",
        "Explain the concept of higher-order components (HOCs) vs render props in React.",
        "What is the significance of React Fiber and how does it improve React's rendering process?",
        "Explain the concept of concurrent mode in React and how it benefits user experience.",
        "What is the purpose of memoization in React and how can it be achieved?",
        "Explain the concept of React suspense and how it can be used for lazy loading.",
        "What is the purpose of React Native and how does it differ from React for web?",
        "Explain the concept of controlled vs uncontrolled components in React forms.",
        "What are React hooks rules and best practices for handling side effects?",
        "Explain the concept of React reconciliation and how it optimizes rendering.",
        "What is the purpose of React error boundaries and how can they be implemented?",
        "Explain the concept of code splitting in React and how it improves performance.",
        "What is the purpose of React Portals and how can they be used?",
        "Explain the concept of React suspense with data fetching and error handling.",
        "What is the significance of the 'shouldComponentUpdate' method in React class components?",
        "Explain the concept of pure components in React and when to use them.",
        "What are the differences between React functional components and class components?",
        "Explain the concept of React reconciliation algorithm and its impact on performance."
    ],
    "Node":[
        "What is Node.js and why is it popular for server-side development?",
        "Explain the concept of event-driven programming in Node.js.",
        "How does Node.js handle asynchronous programming?",
        "What is the difference between callback-based and promise-based asynchronous programming in Node.js?",
        "What is the purpose of the 'npm' package manager in Node.js?",
        "How do you handle errors in Node.js applications?",
        "Explain the concept of streams in Node.js.",
        "What is the purpose of the 'fs' module in Node.js and how can it be used?",
        "How can you handle file uploads in a Node.js application?",
        "What are the benefits of using the Express.js framework in Node.js?",
        "Explain the concept of middleware in the context of Node.js and Express.js.",
        "How can you handle routing in a Node.js application using Express.js?",
        "What is the purpose of the 'body-parser' middleware in Express.js?",
        "Explain the concept of RESTful APIs and how you can implement them in Node.js.",
        "What is the purpose of the 'jsonwebtoken' module in Node.js and how can it be used for authentication?",
        "How can you connect to a database from a Node.js application?",
        "What is the purpose of the 'mongoose' library in Node.js and how can it be used for MongoDB integration?",
        "Explain the concept of clustering in Node.js and how it can improve performance.",
        "What are the benefits of using WebSockets in a Node.js application?",
        "How can you handle sessions and cookies in a Node.js application?",
        "What is the purpose of the 'dotenv' module in Node.js?",
        "Explain the concept of child processes in Node.js and how you can create them.",
        "How can you handle caching in a Node.js application to improve performance?",
        "What is the purpose of the 'pm2' module in Node.js and how can it be used for process management?",
        "Explain the concept of server-side rendering (SSR) in Node.js.",
        "How can you implement authentication and authorization in a Node.js application?",
        "What is the purpose of the 'multer' middleware in Node.js and how can it be used for file uploads?",
        "How can you secure a Node.js application and protect it from common vulnerabilities?",
        "Explain the concept of event emitters in Node.js and how you can use them for inter-process communication.",
        "What are the differences between the 'http' and 'https' modules in Node.js?",
        "How can you handle cross-origin resource sharing (CORS) in a Node.js application?",
        "What is the purpose of the 'cluster' module in Node.js and how can it be used for load balancing?",
        "Explain the concept of template engines in Node.js and provide examples of popular ones.",
        "How can you write unit tests for a Node.js application?",
        "What is the purpose of the 'axios' library in Node.js and how can it be used for making HTTP requests?",
        "Explain the concept of JSON Web Tokens (JWT) and how they can be used for authentication in a Node.js application.",
        "How can you handle database migrations in a Node.js application?",
        "What is the purpose of the 'helmet' middleware in Node.js and how can it be used for enhancing application security?",
        "Explain the concept of promises in Node.js and how they can simplify asynchronous programming.",
        "Explain the concept of middleware in the context of Node.js and how it can be used to handle authentication.",
        "What are the benefits of using GraphQL over REST in a Node.js backend?",
        "How can you implement rate limiting in a Node.js application to prevent abuse and protect resources?",
        "What are the different types of caching strategies you can implement in a Node.js backend?",
        "Explain the concept of message queues and how they can be used for asynchronous processing in a Node.js backend.",
        "How can you handle database transactions in a Node.js application to ensure data integrity?",
        "What is the purpose of indexing in databases and how can you optimize database queries in a Node.js backend?",
        "Explain the concept of load balancing and how it can be implemented in a Node.js backend.",
        "How can you implement pagination in a Node.js backend to efficiently retrieve large datasets?",
        "What are the best practices for handling and storing sensitive information, such as passwords, in a Node.js backend?",
        "Explain the concept of containerization and how it can be used to deploy Node.js applications.",
        "What are the benefits of using Redis in a Node.js backend and how can it be integrated?",
        "How can you implement WebSockets in a Node.js backend for real-time communication?",
        "What is the purpose of request validation in a Node.js backend and how can you implement it effectively?",
        "Explain the concept of microservices architecture and how it can be implemented in a Node.js backend.",
        "How can you handle file storage and retrieval in a Node.js backend, such as storing images or documents?",
        "What are the challenges of scaling a Node.js backend and how can you overcome them?",
        "Explain the concept of data normalization and denormalization in databases and their impact on a Node.js backend.",
        "How can you implement distributed caching in a Node.js backend to improve performance?",
        "What are the best practices for logging and monitoring in a Node.js backend application?"
    ],
    "MongoDB":[
        "What is MongoDB and why is it popular for database management?",
        "Explain the difference between SQL and NoSQL databases.",
        "What are the advantages of using MongoDB over traditional relational databases?",
        "What is BSON and how is it related to MongoDB?",
        "Explain the concept of a document in MongoDB.",
        "What is a collection in MongoDB and how does it differ from a table in a relational database?",
        "What are the different types of indexes in MongoDB and how can they improve query performance?",
        "Explain the concept of sharding in MongoDB and how it enables horizontal scaling.",
        "What is the purpose of the '_id' field in MongoDB documents and how is it generated?",
        "Explain the difference between find() and findOne() methods in MongoDB.",
        "How can you perform CRUD operations (create, read, update, delete) in MongoDB?",
        "What are the aggregation pipelines in MongoDB and how can they be used for data processing?",
        "Explain the concept of transactions in MongoDB and when they should be used.",
        "How can you create a backup and restore a MongoDB database?",
        "What is the purpose of the 'mongod' and 'mongo' commands in MongoDB?",
        "Explain the concept of replication in MongoDB and how it ensures data availability and redundancy.",
        "What are the different types of queries you can perform in MongoDB?",
        "What is the purpose of the 'explain' method in MongoDB and how can it be used for query optimization?",
        "Explain the concept of compound indexes in MongoDB and how they can improve query performance.",
        "How can you perform text search in MongoDB?",
        "What is the purpose of the 'map-reduce' function in MongoDB and how can it be used for data analysis?",
        "Explain the concept of geospatial indexing in MongoDB and how it can be used for location-based queries.",
        "What are the different types of joins in MongoDB and how can you perform them?",
        "How can you perform data aggregation and grouping in MongoDB?",
        "Explain the concept of TTL (time-to-live) indexes in MongoDB and how they can be used for data expiration.",
        "What is the purpose of the 'mongos' process in MongoDB and how does it enable sharded clusters?",
        "How can you implement access control and user authentication in MongoDB?",
        "What is the purpose of the 'replSet' configuration in MongoDB and how can it be used for replica set setup?",
        "Explain the concept of data modeling in MongoDB and best practices for schema design.",
        "How can you handle schema migrations and versioning in MongoDB?",
        "What is the purpose of the 'gridfs' storage engine in MongoDB and when should it be used?",
        "Explain the concept of capped collections in MongoDB and how they differ from regular collections.",
        "How can you perform full-text search in MongoDB?",
        "What are the considerations for scaling a MongoDB database and what options are available?",
        "Explain the concept of database profiling in MongoDB and how it can be used for performance optimization.",
        "How can you perform backups and recovery in a sharded MongoDB cluster?",
        "What is the purpose of the 'mongodump' and 'mongorestore' commands in MongoDB?",
        "Explain the concept of change streams in MongoDB and how they can be used for real-time data synchronization.",
        "What are the best practices for securing a MongoDB database and preventing unauthorized access?",
        "How can you monitor and optimize the performance of a MongoDB database?",
        "What is the purpose of the 'wiredTiger' storage engine in MongoDB and how does it differ from the 'MMAPv1' storage engine?",
        "Explain the concept of database profiling in MongoDB and how it can be used for performance optimization.",
        "How can you perform backups and recovery in a sharded MongoDB cluster?",
        "What is the purpose of the 'mongodump' and 'mongorestore' commands in MongoDB?",
        "Explain the concept of change streams in MongoDB and how they can be used for real-time data synchronization.",
        "What are the best practices for securing a MongoDB database and preventing unauthorized access?",
        "How can you monitor and optimize the performance of a MongoDB database?",
        "Explain the concept of the 'wiredTiger' storage engine in MongoDB and how it differs from the 'MMAPv1' storage engine.",
        "What is the purpose of the 'oplog' in MongoDB and how is it used for replication?",
        "How can you perform schema validation in MongoDB to enforce document structure?",
        "Explain the concept of database normalization in MongoDB and when it should be applied.",
        "What are the advantages and disadvantages of embedding documents vs. referencing documents in MongoDB?",
        "How can you implement optimistic concurrency control in MongoDB?",
        "Explain the concept of secondary indexes in MongoDB and how they can improve query performance.",
        "What are the considerations for scaling a MongoDB database horizontally?",
        "How can you perform geo-spatial queries and indexing in MongoDB?",
        "Explain the concept of database sharding in MongoDB and how it allows for horizontal scalability.",
        "What is the purpose of the 'mongostat' command in MongoDB and what information does it provide?",
        "How can you implement field-level encryption in MongoDB to protect sensitive data?",
        "Explain the concept of document versioning in MongoDB and how it can be implemented.",
        "What are the different options available for data backup and recovery in MongoDB?",
        "How can you use the 'explain' method in MongoDB to analyze query performance?",
        "Explain the concept of the 'snapshot' isolation level in MongoDB and how it ensures data consistency.",
        "What is the purpose of the 'collation' feature in MongoDB and how can it be used for string comparisons?",
        "How can you handle concurrent writes to a single document in MongoDB?",
        "Explain the concept of read concern and write concern in MongoDB and how they impact data consistency.",
        "What are the considerations for choosing between a single MongoDB server vs. replica sets vs. sharded clusters?",
        "How can you implement full-text search in MongoDB?",
        "Explain the concept of horizontal partitioning in MongoDB and how it can be achieved.",
        "What are the considerations for designing a schema for time-series data in MongoDB?",
        "How can you implement change data capture in MongoDB to track and capture data changes?",
        "Explain the concept of data denormalization in MongoDB and when it should be applied."
    ],
    "ProblemSolving":[
      "<div><p>Find the Longest Substring Without Repeating Characters</p> <p>Sample Input: abcabcbb</p><p>Sample Output: 3</p></div>",
      "<div><p>Given an Array of Integers, Find Two Numbers that Add up to a Target Sum</p><p>Sample Input: [2, 7, 11, 15], 9</p><p>Sample Output: [2, 7]</p></div>",
      "<div><p>Reverse a Linked List</p><p>Sample Input: 1 -> 2 -> 3 -> 4 -> 5</p><p>Sample Output: 5 -> 4 -> 3 -> 2 -> 1</p></div>",
      "<div><p>Find the Missing Number in a Sorted Array</p><p>Sample Input: [1, 2, 3, 5, 6]</p><p>Sample Output: 4</p></div>",
      "<div><p>Given a Matrix, Rotate it 90 Degrees Clockwise</p><p>Sample Input:</p><p>[[1, 2, 3],</p><p>[4, 5, 6],</p><p>[7, 8, 9]]</p><p>Sample Output:</p><p>[[7, 4, 1],</p><p>[8, 5, 2],</p><p>[9, 6, 3]]</p></div>",
      "<div><p>Implement a Stack using Linked List</p><p>Sample Input/Output: See implementation details</p></div>",
      "<div><p>Find the First Non-Repeating Character in a String</p><p>Sample Input: abacabad</p><p>Sample Output: c</p></div>",
      "<div><p>Given an Array of Integers, Find the Maximum Product of Two Numbers</p><p>Sample Input: [1, 2, 3, 4, 5]</p><p>Sample Output: 20</p></div>",
      "<div><p>Write a function that takes an array of strings and returns the longest string.</p><p>Sample Input: ['apple', 'banana', 'orange']</p><p>Sample Output: 'banana'</p></div>",
      "<div><p>Given a string, find the longest substring that contains only digits.</p> <p>Sample Input</p> <p>'hello world123'</p> <p>Sample Output</p> <p>'123'</p></div>",
      "<div><p>Write a function that takes a string and returns the number of vowels in the string.</p><p>Sample Input: 'hello'</p><p>Sample Output: 2</p></div>",
        "<div><p>Write a function that takes an array of numbers and returns the difference between the largest and smallest numbers.</p><p>Sample Input: [5, 2, 9, 1, 7]</p><p>Sample Output: 8</p></div>",
        "<div><p>Write a function that takes an array of integers and returns the length of the longest increasing subarray.</p><p>Sample Input: [1, 2, 3, 2, 5, 7, 2, 4, 6]</p><p>Sample Output: 4</p></div>",
        "<div><p>Write a function that takes a string and returns the length of the longest substring without repeating characters.</p><p>Sample Input: 'abcabcbb'</p><p>Sample Output: 3</p></div>",
        "<div><p>Write a function that takes an array of integers and returns the number of unique triplets that sum up to zero.</p><p>Sample Input: [-1, 0, 1, 2, -1, -4]</p><p>Sample Output: 2</p></div>",
        "<div><p>Write a function that takes a matrix (2D array) of integers and rotates it 90 degrees clockwise.</p><p>Sample Input: [[1, 2, 3], [4, 5, 6], [7, 8, 9]]</p><p>Sample Output: [[7, 4, 1], [8, 5, 2], [9, 6, 3]]</p></div>",
        "<div><p>Write a function that takes an array of integers and rearranges the array in such a way that every second element is greater than its left and right elements.</p><p>Sample Input: [1, 2, 3, 4, 5, 6]</p><p>Sample Output: [1, 3, 2, 5, 4, 6]</p></div>",
        "<div><p>Write a function that takes a string and returns the length of the longest palindromic substring.</p><p>Sample Input: 'babad'</p><p>Sample Output: 3</p></div>",
        "<div><p>Write a function that takes two arrays of integers and returns the intersection of the two arrays.</p><p>Sample Input: [1, 2, 2, 1], [2, 2]</p><p>Sample Output: [2]</p></div>",
        "<div><p>Write a function that takes a binary tree and returns the maximum sum of a path from any node to any other node.</p><p>Sample Input: [1, 2, 3]</p><p>Sample Output: 6</p></div>",
        "<div><p>Write a function that takes a sorted array of integers and finds the missing number in the range from the first to the last element.</p><p>Sample Input: [1, 2, 4, 5, 6]</p><p>Sample Output: 3</p></div>",
        "<div><p>Write a function that takes a string and a dictionary of words and returns all possible word break combinations of the string.</p><p>Sample Input: 'catsanddog', ['cat', 'cats', 'and', 'sand', 'dog']</p><p>Sample Output: ['cats and dog', 'cat sand dog']</p></div>",
        "<div><p>Write a function that takes a string and returns all valid IP addresses that can be formed by splitting the string into four parts.</p><p>Sample Input: '25525511135'</p><p>Sample Output: ['255.255.11.135', '255.255.111.35']</p></div>",
        "<div><p>Write a function that takes an array of intervals and merges overlapping intervals.</p><p>Sample Input: [[1, 3], [2, 6], [8, 10], [15, 18]]</p><p>Sample Output: [[1, 6], [8, 10], [15, 18]]</p></div>",
        "<div><p>Write a function that takes a string and returns the length of the longest valid parentheses substring.</p><p>Sample Input: '(()'</p><p>Sample Output: 2</p></div>",
        "<div><p>Write a function that takes a string and returns the minimum number of cuts needed to partition the string into palindromes.</p><p>Sample Input: 'aab'</p><p>Sample Output: 1</p></div>",
        "<div><p>Write a function that takes an array of integers and returns the maximum possible sum of a non-adjacent subarray.</p><p>Sample Input: [2, 4, 6, 2, 5]</p><p>Sample Output: 13</p></div>",
        "<div><p>Write a function that takes a matrix (2D array) of integers and returns the shortest path sum from the top-left cell to the bottom-right cell.</p><p>Sample Input: [[1, 3, 1], [1, 5, 1], [4, 2, 1]]</p><p>Sample Output: 7</p></div>",
        "<div><p>Write a function that takes a string and returns all possible valid permutations of parentheses pairs.</p><p>Sample Input: 3</p><p>Sample Output: ['((()))', '(()())', '(())()', '()(())', '()()()']</p></div>",
        "<div><p>Write a function that takes an array of integers and returns the length of the longest increasing subsequence.</p><p>Sample Input: [10, 9, 2, 5, 3, 7, 101, 18]</p><p>Sample Output: 4</p></div>",
        "<div><p>Write a function that takes a string and a dictionary of words and returns all valid word break combinations with the minimum number of words.</p><p>Sample Input: 'catsanddog', ['cat', 'cats', 'and', 'sand', 'dog']</p><p>Sample Output: ['cats and dog']</p></div>",
        "<div><p>Write a function that takes two strings and returns the minimum number of operations required to convert one string to another.</p><p>Sample Input: 'horse', 'ros'</p><p>Sample Output: 3</p></div>"

    ]
}
